'''
기본적인 전제
1. 3개의 문이 있다
2. 3개중의 하나의 문 뒤에만 염소가 있다
3. 각각의 문에서 염소를 발견할 확률은 1/3
4. 문을 하나 고른다
5. 그 문을 제외한 나머지 두개의 문중에 하나를 열었을때 염소가 없다면
6. 내 선택을 바꾸는것과 그대로 두는것중에 어떤것이 확률이 더 높은가?
'''
'''
문제를 다시 살펴보고 난 뒤에 검증해볼 필요가 없음을 꺠달음
모르고 있던 전제
세개의 문 뒤에 하나는 자동차 두개는 염소가 있다
처음 문을 선택 한 뒤에 사회자가 하나의 문을 열어서 
염소의 위치를 알려준 뒤에 처음 선택을 바꿀것인지 물어보면 바꿔야 하나 말아야 하나??
전제1. 사회자는 정답의 위치를 알고있다
전제2. 사회자는 꽝을 열어서 보여줄수 있다
'''
'''
무조건 바꾸는게 유리하다
이유는 단순하게 생각할수 있다.
처음 세개의 문 중에서 염소를 고를 확률이 2/3로 높기 때문이다
염소를 골랐다는 가정하에 사회자가 다른 염소의 문을 열어줬기 때문에 무조건 바꿔야 정답을 맞출수 있다.
처음 세개의 문 중에서 자동차를 고를 확률은 1/3
바꾸면 안되지만 처음 선택에서 염소를 골랐을 확률이 높기 때문에 바꾸는게 2/3 확률을 가져가는것
'''